# Поработайте с переменными, создайте несколько, выведите на экран, запросите у
# пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

id = 1233
device = 'iPhone'
person = 5.1
print(f'Смартфон {device} с номером {id} купил {person}')

name = (input('Введите ваше имя:  '))
prof = (input('Кем вы работаете:  '))
age = int((input('Напишите возраст вашего внутреннего ребенка, который мешает вам работать:  ')))

print(f'{name} по профессии {prof} в возрасте {age} летнего внутреннего ребенка ')